# Exploratory Analysis of Currency Exchange Rates - USD vs Other Countries

In this Python notebook, we'll be investigating the strength of the US Dollar against other countries over the last 6 election cyles (24 years) to understand how the exchange rates change before and after Election Day in a 30-day window. We'll explore the volatility of the currencies during this wind The currencies of our focused analysis are: Euro (EUR), Japananese Yen (JPY), and the Chinese Yuan (CNY). 

All of our data will be pulled from Federal Reserve at [https://www.federalreserve.gov/](https://www.federalreserve.gov/).

In [1]:
# Import Dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

ModuleNotFoundError: No module named 'matplotlib'

# Let's collect daily exchange rate data for the currencies of interest
Source: [https://www.federalreserve.gov/releases/h10/hist/default.htm](https://www.federalreserve.gov/releases/h10/hist/default.htm)

Our method is to save the raw html file locally and use the read_html() function to read the tables. There will be an html file for each country in the 'Resources' folder.

In [ ]:
# list of all countries by their currency abbreviation 
currencies = ['CNY', 'JPY', 'EUR']

# Past 8 election dates
election_dates = pd.to_datetime(['2004-11-03', '2008-11-04', '2012-11-06', '2016-11-08', '2020-11-03', '2024-11-05'])
print(election_dates)

In [61]:
# All url's stored as variables
china_url = 'Resources/FRB_daily_china.html'
japan_url = 'Resources/FRB_daily_japan.html'
euro_url = 'Resources/FRB_daily_euro.html'


# Read the html file into the tables variable
tables_china_daily_xchange = pd.read_html(china_url)
tables_japan_daily_xchange = pd.read_html(japan_url)
tables_euro_daily_xchange = pd.read_html(euro_url)

# Let's check how many tables we extracted
print(f'There are {len(tables_china_daily_xchange)} table(s) extracted from the China exchanges rates url.')
print(f'There are {len(tables_japan_daily_xchange)} table(s) extracted from the Japan exchanges rates url.')
print(f'There are {len(tables_euro_daily_xchange)} table(s) extracted from the Euro exchanges rates url.')

# Create the data frames for all of our exchange rates 
df_china_daily = tables_china_daily_xchange[0]
df_japan_daily = tables_japan_daily_xchange[0]
df_euro_daily = tables_euro_daily_xchange[0]

# Preview our df
display(df_china_daily)
display(df_japan_daily)
display(df_euro_daily)

There are 1 table(s) extracted from the China exchanges rates url.
There are 1 table(s) extracted from the Japan exchanges rates url.
There are 1 table(s) extracted from the Euro exchanges rates url.

           Date    Rate
0      3-JAN-00  8.2798
1      4-JAN-00  8.2799
2      5-JAN-00  8.2798
3      6-JAN-00  8.2797
4      7-JAN-00  8.2794
...         ...     ...
6530  13-JAN-25  7.3319
6531  14-JAN-25  7.3311
6532  15-JAN-25  7.3304
6533  16-JAN-25  7.3316
6534  17-JAN-25  7.3249

[6535 rows x 2 columns]

           Date      Rate
0      3-JAN-00  101.7000
1      4-JAN-00  103.0900
2      5-JAN-00  103.7700
3      6-JAN-00  105.1900
4      7-JAN-00  105.1700
...         ...       ...
6530  13-JAN-25  157.5100
6531  14-JAN-25  157.9500
6532  15-JAN-25  156.6000
6533  16-JAN-25  155.4400
6534  17-JAN-25  156.3000

[6535 rows x 2 columns]

           Date    Rate
0      3-JAN-00  1.0155
1      4-JAN-00  1.0309
2      5-JAN-00  1.0335
3      6-JAN-00  1.0324
4      7-JAN-00  1.0294
...         ...     ...
6535  20-JAN-25      ND
6536  21-JAN-25  1.0423
6537  22-JAN-25  1.0420
6538  23-JAN-25  1.0420
6539  24-JAN-25  1.0515

[6540 rows x 2 columns]

In [62]:
# Let's rename the 'Rate' column to their respective their country
df_china_daily.rename(columns={'Rate': 'CNY'}, inplace=True)
df_japan_daily.rename(columns={'Rate': 'JPY'}, inplace=True)
df_euro_daily.rename(columns={'Rate': 'EUR'}, inplace=True)


# Preview each dataframe to confirm the addition of the column
display(df_china_daily)
display(df_japan_daily)
display(df_euro_daily)

           Date     CNY
0      3-JAN-00  8.2798
1      4-JAN-00  8.2799
2      5-JAN-00  8.2798
3      6-JAN-00  8.2797
4      7-JAN-00  8.2794
...         ...     ...
6530  13-JAN-25  7.3319
6531  14-JAN-25  7.3311
6532  15-JAN-25  7.3304
6533  16-JAN-25  7.3316
6534  17-JAN-25  7.3249

[6535 rows x 2 columns]

           Date       JPY
0      3-JAN-00  101.7000
1      4-JAN-00  103.0900
2      5-JAN-00  103.7700
3      6-JAN-00  105.1900
4      7-JAN-00  105.1700
...         ...       ...
6530  13-JAN-25  157.5100
6531  14-JAN-25  157.9500
6532  15-JAN-25  156.6000
6533  16-JAN-25  155.4400
6534  17-JAN-25  156.3000

[6535 rows x 2 columns]

           Date     EUR
0      3-JAN-00  1.0155
1      4-JAN-00  1.0309
2      5-JAN-00  1.0335
3      6-JAN-00  1.0324
4      7-JAN-00  1.0294
...         ...     ...
6535  20-JAN-25      ND
6536  21-JAN-25  1.0423
6537  22-JAN-25  1.0420
6538  23-JAN-25  1.0420
6539  24-JAN-25  1.0515

[6540 rows x 2 columns]

In [63]:
# On each dataframe, replace value 'ND' with NaN
df_china_daily = df_china_daily.replace('ND', np.nan)
df_japan_daily = df_japan_daily.replace('ND', np.nan)
df_euro_daily = df_euro_daily.replace('ND', np.nan)

In [67]:
# check for null values
display(df_china_daily.isnull().sum())
display(df_japan_daily.isnull().sum())
display(df_euro_daily.isnull().sum())

Date      0
CNY     254
dtype: int64

Date      0
JPY     255
dtype: int64

Date      0
EUR     256
dtype: int64

In [68]:
# Let's set the 'Date' column as the index
df_china_daily.set_index('Date', inplace=True)
df_japan_daily.set_index('Date', inplace=True)
df_euro_daily.set_index('Date', inplace=True)

In [69]:
# Preview each dataframe to confirm the index is set to Date
display(df_china_daily)
display(df_japan_daily)
display(df_euro_daily)

              CNY
Date
3-JAN-00   8.2798
4-JAN-00   8.2799
5-JAN-00   8.2798
6-JAN-00   8.2797
7-JAN-00   8.2794
...           ...
13-JAN-25  7.3319
14-JAN-25  7.3311
15-JAN-25  7.3304
16-JAN-25  7.3316
17-JAN-25  7.3249

[6535 rows x 1 columns]

                JPY
Date
3-JAN-00   101.7000
4-JAN-00   103.0900
5-JAN-00   103.7700
6-JAN-00   105.1900
7-JAN-00   105.1700
...             ...
13-JAN-25  157.5100
14-JAN-25  157.9500
15-JAN-25  156.6000
16-JAN-25  155.4400
17-JAN-25  156.3000

[6535 rows x 1 columns]

              EUR
Date
3-JAN-00   1.0155
4-JAN-00   1.0309
5-JAN-00   1.0335
6-JAN-00   1.0324
7-JAN-00   1.0294
...           ...
20-JAN-25     NaN
21-JAN-25  1.0423
22-JAN-25  1.0420
23-JAN-25  1.0420
24-JAN-25  1.0515

[6540 rows x 1 columns]

In [70]:
# Let's merge all three data frames based on the date index
df_currency_rates = pd.merge(df_china_daily, df_japan_daily, on='Date', how='outer').merge(df_euro_daily, on='Date', how='outer')
df_currency_rates

             CNY       JPY     EUR
Date
1-APR-02  8.2780  133.3200  0.8806
1-APR-03  8.2773  118.2500  1.0904
1-APR-04  8.2769  103.7000  1.2358
1-APR-05  8.2765  107.5700  1.2896
1-APR-08  7.0116  101.7700  1.5615
...          ...       ...     ...
9-SEP-19  7.1210  107.1400  1.1056
9-SEP-20  6.8308  106.2300  1.1810
9-SEP-21  6.4547  109.7600  1.1827
9-SEP-22  6.9240  142.4400  1.0046
9-SEP-24  7.1133  142.9200  1.1042

[6540 rows x 3 columns]

In [71]:
# Let's investigate all the data types of our newly merged df
df_currency_rates.describe()

           CNY       JPY     EUR
count     6281      6280    6284
unique    3622      3551    3638
top     8.2765  108.5300  1.1236
freq       208         9       9

In [72]:
df_currency_rates.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6540 entries, 1-APR-02 to 9-SEP-24
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CNY     6281 non-null   object
 1   JPY     6280 non-null   object
 2   EUR     6284 non-null   object
dtypes: object(3)
memory usage: 204.4+ KB

In [77]:
# Convert all values to float type
df_currency_rates['CNY'] = pd.to_numeric(df_currency_rates['CNY'], errors='coerce')
df_currency_rates['JPY'] = pd.to_numeric(df_currency_rates['JPY'], errors='coerce')
df_currency_rates['EUR'] = pd.to_numeric(df_currency_rates['EUR'], errors='coerce')

df_currency_rates.dtypes

CNY    float64
JPY    float64
EUR    float64
dtype: object

In [80]:
# Check for null values
display(df_currency_rates.shape)
df_currency_rates.isnull().sum()

(6540, 3)

CNY    259
JPY    260
EUR    256
dtype: int64

In [81]:
# Drop all rows where we have null values
df_currency_rates.dropna(inplace=True)

In [82]:
# Verify 0 null values
df_currency_rates.isnull().sum()

CNY    0
JPY    0
EUR    0
dtype: int64

In [ ]:
election_windows = []

#calculate the total 30 days (15 before and 15 after) for each election date
for date in election_dates:
    start_date = date - pd.Timedelta(days=15)
    end_date = date + pd.Timedelta(days=15)
    election_windows[date.year] = (start_date, end_date)

    print(election_dates)

NameError: name 'election_dates' is not defined